app/views/posts/show.html.erb

<ul>
  <% @post.post_comment.each do |post_comment|%>
---
SELECT "posts".* FROM "posts"