app/controllers/posts_controller.rb

  def show
    @post = Post.find{params[:id]}
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(permit_post)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("desc", "created_at", "updated_at") VALUES (?, ?, ?)  [["desc", "231"], ["created_at", "2017-04-19 17:03:21.654597"], ["updated_at", "2017-04-19 17:03:21.654597"]]